Catalogs/упТарифныеСетки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТарифныеСетки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеТарифнойСетки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТарифнойСеткиПоСтолбцам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПоказателиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТарифнойСеткиПоСтрокам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПоказателиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИдентификаторыСсылок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упТарифныеСетки/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция - Собрать данные тарифной сетки
//
// Параметры:
//  Ссылка - Ссылка	 - Ссылка
// 
// Возвращаемое значение:
//  ДанныеТарифнойСетки - данные.
//
Функция СобратьДанныеТарифнойСетки(Ссылка) Экспорт 

	ДанныеТарифнойСетки = Ссылка.ДанныеТарифнойСетки.Получить();
	Если ДанныеТарифнойСетки <> Неопределено Тогда
		Если ЗначениеЗаполнено(Ссылка.ПоказательТарифнойСеткиПоСтолбцам) Тогда
			СоотвествиеСсылок = Новый Соответствие;
			Для Каждого СтрокаИдентификатора Из Ссылка.ИдентификаторыСсылок Цикл
				СоотвествиеСсылок.Вставить(СтрокаИдентификатора.Идентификатор, СтрокаИдентификатора.Значение);
			КонецЦикла;
			СтрокаЗаголовков = ДанныеТарифнойСетки[0];
			Для Индекс = 0 По ДанныеТарифнойСетки.Колонки.Количество() - 1 Цикл
				НовоеЗначение = СоотвествиеСсылок[СтрокаЗаголовков[Индекс]];
				Если НовоеЗначение <> Неопределено Тогда
					СтрокаЗаголовков[Индекс] = НовоеЗначение;
				КонецЕсли; 
			КонецЦикла;
			КолонкаЗаголовков = ДанныеТарифнойСетки.Колонки[0];
			Для Индекс = 0 По ДанныеТарифнойСетки.Количество() - 1 Цикл
				НовоеЗначение = СоотвествиеСсылок[ДанныеТарифнойСетки[Индекс][0]];
				Если НовоеЗначение <> Неопределено Тогда
					ДанныеТарифнойСетки[Индекс][0] = НовоеЗначение;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;
	Возврат ДанныеТарифнойСетки;
	
КонецФункции
	
#КонецОбласти
